{
  "profile": [
    "Hello! I'm a full-stack JavaScript developer with a strong specialization in React for front-end development and Node.js for back-end development. My expertise includes building dynamic, responsive web applications, creating and consuming REST APIs, and working with databases like MongoDB and PostgreSQL. With a passion for web development, I have honed my skills through numerous projects, enhancing my problem-solving abilities and attention to detail. My diverse skill set allows me to effectively bridge the gap between front-end and back-end development, ensuring seamless and efficient application performance."
  ],
  "details": [
    {
      "type": "text",
      "name": "Country",
      "value": "Belarus"
    },
    {
      "type": "text",
      "name": "City",
      "value": "Gomel"
    },
    {
      "type": "tel",
      "name": "Phone",
      "value": "+375 29 607-07-57"
    },
    {
      "type": "email",
      "name": "Email",
      "value": "ds.kavaliou@gmail.com"
    },
    {
      "type": "text",
      "name": "Telegram",
      "value": "@xgPLhu6x"
    },
    {
      "type": "link",
      "name": "Github",
      "value": "https://github.com/ds-kavaliou"
    }
  ],
  "skills": [
    {
      "name": "HTML/CSS",
      "value": "Strong understanding of HTML markup and CSS styling, including responsive design (using media queries, flexbox, or CSS grid layouts), CSS preprocessors (e.g., Sass), and CSS frameworks (e.g., Bootstrap, Tailwind CSS)"
    },
    {
      "name": "JavaScript/TypeScript",
      "value": "Proficient in JavaScript/TypeScript programming, with a strong understanding of its core concepts, features, and modern ES6+ syntax"
    },
    {
      "name": "React/Next/Remix",
      "value": "Proficient in React library, including its component-based architecture, virtual DOM, and state management concepts. Experienced in building dynamic user interfaces and scalable web applications with its popular frameworks such as Next.js and Remix, leveraging their server-side rendering (SSR) capabilities, routing, and API integration features to create high-performance and SEO-friendly applications"
    },
    {
      "name": "REST API/GraphQL",
      "value": "Understanding of RESTful principles and experience in consuming and integrating data from APIs, including handling requests, authentication, data manipulation, and implementing GraphQL queries and mutations."
    },
    {
      "name": "Node.js",
      "value": "Proficient in Node.js, utilizing its powerful runtime environment for server-side development. Experienced in frameworks like Express and Nest.js, enabling the creation of scalable and modular applications."
    },
    {
      "name": "DBs",
      "value": "xperienced with both SQL and NoSQL databases. Proficient in database technologies such as MongoDB, PostgreSQL, and MySQL, including designing schemas, writing complex queries, optimizing performance, and ensuring data integrity and security."
    }
  ],
  "education": [
    {
      "name": "University: Francisk Skorina Gomel State University, Physics and IT (2021-2026)",
      "value": "https://www.gsu.by/en/node/1138"
    },
    {
      "name": "RS Schools Course 2022 Q2",
      "value": "https://app.rs.school/certificate/axrekcog"
    },
    {
      "name": "RS Schools Course 2022 Q3",
      "value": "https://app.rs.school/certificate/c6ncbw3n"
    }
  ],
  "experience": [
    {
      "name": "Fullstack Developer",
      "project": "Custom CMS for restaurant",
      "description": "Developed and managed an online restaurant platform to sell sushi. Implemented a custom CMS and frontend for seamless customer experience.",
      "startAt": "2023-01-01T00:00:00.000Z",
      "endAt": "2024-01-01T00:00:00.000Z",
      "role": [
        "Designed and developed a custom CMS using React and Node.js",
        "Integrated various payment gateways and ensured secure transactions",
        "Optimized the frontend for performance and SEO",
        "Collaborated with designers to create a user-friendly interface",
        "Implemented real-time order tracking and notification system"
      ],
      "stack": ["React", "Next.js", "Supabase", "Tailwind"]
    },
    {
      "name": "Fullstack Developer",
      "project": "E-commerce App with Telegram Bot",
      "description": "Developed and managed an online shop to sell honey.",
      "startAt": "2023-01-01T00:00:00.000Z",
      "endAt": "2024-01-01T00:00:00.000Z",
      "role": [
        "Designed and developed a custom CMS using React and Node.js",
        "Integrated various payment gateways and ensured secure transactions",
        "Optimized the frontend for performance and SEO",
        "Collaborated with designers to create a user-friendly interface",
        "Implemented real-time order tracking and notification system"
      ],
      "stack": ["UI/UX", "React", "Remix.run", "Tailwind", "Telegram API"]
    }
  ]
}
