{
  "profile": [
    "I am a dedicated full-stack developer with over two years of hands-on experience in building dynamic and responsive web applications. My primary expertise lies in frontend development using React and its advanced frameworks such as Next.js and Remix.run. I have a strong passion for creating user-friendly interfaces and seamless user experiences, leveraging my deep understanding of JavaScript, HTML, and CSS.",
    "On the backend, I am proficient in Node.js and its powerful frameworks like Express and Nest.js, which allow me to develop robust and scalable server-side applications. My approach to development emphasizes clean, maintainable code and a thorough understanding of the entire web development lifecycle."
  ],
  "details": [
    {
      "type": "text",
      "name": "Country",
      "value": "Belarus"
    },
    {
      "type": "text",
      "name": "City",
      "value": "Gomel"
    },
    {
      "type": "tel",
      "name": "Phone",
      "value": "+375 29 607-07-57"
    },
    {
      "type": "email",
      "name": "Email",
      "value": "ds.kavaliou@gmail.com"
    },
    {
      "type": "telegram",
      "name": "Telegram",
      "value": "xgPLhu6x"
    },
    {
      "type": "github",
      "name": "Github",
      "value": "ds-kavaliou"
    }
  ],
  "skills": [
    {
      "name": "HTML/CSS",
      "value": "Strong understanding of HTML markup and CSS styling, including responsive design (using media queries, flexbox, or CSS grid layouts), CSS preprocessors (e.g., Sass), and CSS frameworks (e.g., Bootstrap, Tailwind CSS)"
    },
    {
      "name": "JavaScript/TypeScript",
      "value": "Proficient in JavaScript/TypeScript programming, with a strong understanding of its core concepts, features, and modern ES6+ syntax"
    },
    {
      "name": "React/Next/Remix",
      "value": "Proficient in React library, including its component-based architecture, virtual DOM, and state management concepts. Experienced in building dynamic user interfaces and scalable web applications with its popular frameworks such as Next.js and Remix, leveraging their server-side rendering (SSR) capabilities, routing, and API integration features to create high-performance and SEO-friendly applications"
    },
    {
      "name": "REST API/GraphQL",
      "value": "Understanding of RESTful principles and experience in consuming and integrating data from APIs, including handling requests, authentication, data manipulation, and implementing GraphQL queries and mutations."
    },
    {
      "name": "Node.js",
      "value": "Proficient in Node.js, utilizing its powerful runtime environment for server-side development. Experienced in frameworks like Express and Nest.js, enabling the creation of scalable and modular applications."
    },
    {
      "name": "DBs",
      "value": "Experienced with both SQL and NoSQL databases. Proficient in database technologies such as MongoDB, PostgreSQL, and MySQL, including designing schemas, writing complex queries, optimizing performance, and ensuring data integrity and security."
    }
  ],
  "education": [
    {
      "name": "University: Francisk Skorina Gomel State University, Physics and IT (2021-2026)",
      "value": "https://www.gsu.by/en/node/1138"
    },
    {
      "name": "RS Schools Course 2022 Q2",
      "value": "https://app.rs.school/certificate/axrekcog"
    },
    {
      "name": "RS Schools Course 2022 Q3",
      "value": "https://app.rs.school/certificate/c6ncbw3n"
    }
  ],
  "experience": [
    {
      "name": "Fullstack Developer",
      "project": "Custom CMS for Restaurant",
      "description": "Developed and managed a comprehensive online platform for a restaurant specializing in sushi. Implemented a custom CMS and an optimized frontend to ensure a seamless and engaging customer experience.",
      "startAt": "2023-01-01T00:00:00.000Z",
      "endAt": "2024-01-01T00:00:00.000Z",
      "role": [
        "Designed and developed a custom CMS using React and Node.js.",
        "Collaborated closely with designers to create a user-friendly interface.",
        "Implemented real-time order tracking and a notification system for customers."
      ],
      "stack": ["React", "Next.js", "Auth.js", "Supabase", "Prisma", "Tailwind"]
    },
    {
      "name": "Fullstack Developer",
      "project": "E-commerce App with Telegram Bot Integration",
      "description": "Developed and managed an online shop to sell honey, featuring a cart system and Telegram bot integration.",
      "startAt": "2023-01-01T00:00:00.000Z",
      "endAt": "2024-01-01T00:00:00.000Z",
      "role": [
        "Built a responsive and user-friendly e-commerce platform using React and Remix.run.",
        "Implemented a comprehensive cart system for seamless shopping experience.",
        "Integrated a Telegram bot to handle customer inquiries and order notifications.",
        "Enhanced the platform's performance and SEO to boost visibility and user engagement."
      ],
      "stack": [
        "UI/UX",
        "React",
        "Remix.run",
        "SSR",
        "I18n",
        "Tailwind",
        "Telegram API"
      ]
    }
  ]
}
